<!-- dflook/terraform-github-actions {"workspace":"ghes-graphql-2","backend_type":"remote","backend":"59ed86b8012032b59b0c6946c3085bb2c05d2ed360231b44278b0ff867c68351","plan_job_ref":"Job Test Terraform cloud #171 at https://github.com/dflook/terraform-github-actions/actions/runs/5563632283","plan_hash":"6a057b2a62411e1e70d897aef4fac72627b98f237f07ea021ce6b0e84340060a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __ghes-graphql-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #171](https://github.com/dflook/terraform-github-actions/actions/runs/5563632283)